# ============================================================
# common
# ============================================================

# brew
brew "mise"
brew 'git'
brew 'gh'
brew 'zstd'
brew 'lazygit'
brew 'openssl'
brew 'neovim'
brew 'starship'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# for telescope/lazyvim
brew 'fd'
brew 'fzf'
brew 'luarocks'
brew 'ripgrep'

# for ruby-lsp in LazyVim
brew "mysql"

# cask
cask "font-fira-code-nerd-font"
cask "wezterm@nightly"
cask "visual-studio-code"
cask "raycast"
cask "rectangle"
cask "sequel-ace"
cask "google-japanese-ime"
# cask "google-chrome"
# cask "docker-desktop"
# cask "postman"
# cask "slack"
# cask "zoom"

# ============================================================
# private
# ============================================================

# tap
# tap "heroku/brew"

# brew
# brew "anyenv"
# brew 'watchman'
# brew 'libyaml' # to use psych for rbenv
# brew "golang-migrate"
# brew "heroku/brew/heroku"
# brew "postgresql@14"

# cask
# cask 'firefox'
# cask "iterm2"
# cask "karabiner-elements"
# cask "notion"
# cask "spotify"
# cask "mattermost"
# cask "gather"
# cask "raspberry-pi-imager"
# cask "discord"
# cask "1password"
# cask "xcodes-app"

# vscode asvetliakov.vscode-neovim
# vscode donjayamanne.githistory
# vscode golang.go
# vscode mhutchie.git-graph
# vscode misogi.ruby-rubocop
# vscode ms-python.debugpy
# vscode ms-python.python
# vscode ms-python.vscode-pylance
# vscode ms-python.vscode-python-envs
# vscode ms-vscode-remote.remote-containers
# vscode ms-vsliveshare.vsliveshare
# vscode shopify.ruby-lsp
